app/controllers/pokemons_controller.rb

  def index
    @pokemons = Pokemon.all
---
SELECT `pokemons`.* FROM `pokemons`

  def create
    @pokemon = Pokemon.new(pokemon_params)

    respond_to do |format|
      if @pokemon.save
---
INSERT INTO `pokemons` (`nome`, `tipo`, `categoria`, `created_at`, `updated_at`) VALUES ('a', 'a', 'a', '2019-09-06 02:24:44.772847', '2019-09-06 02:24:44.772847')

  def destroy
    @pokemon.destroy
---
DELETE FROM `pokemons` WHERE `pokemons`.`id` = 1

    def set_pokemon
      @pokemon = Pokemon.find(params[:id])
---
SELECT `pokemons`.* FROM `pokemons` WHERE `pokemons`.`id` = 1 LIMIT 1