app/controllers/pokes_controller.rb

  def index
    @pokes = Poke.all
---
SELECT `pokes`.* FROM `pokes`

  def create
    @poke = Poke.new(poke_params)

    respond_to do |format|
      if @poke.save
---
INSERT INTO `pokes` (`nome`, `tipo`, `categoria`, `created_at`, `updated_at`) VALUES ('a', 'a', 'a', '2019-09-06 02:13:06.086410', '2019-09-06 02:13:06.086410')

    def set_poke
      @poke = Poke.find(params[:id])
---
SELECT `pokes`.* FROM `pokes` WHERE `pokes`.`id` = 1 LIMIT 1