app/controllers/pokedexes_controller.rb

  def index
    @pokedexes = Pokedex.all
---
SELECT `pokedexes`.* FROM `pokedexes`